quick-test.yml
settings:
  artifacts-dir: ${PWD}/report/%d-%m-%y--%H:%M

execution:
- concurrency: 150
  ramp-up: 1m
  hold-for: 5m
  scenario: quick-test

scenarios:
  quick-test:
    requests:
       - url: http://10.20.40.20:8080/main
         method: GET
         label: Home page

       - url: http://10.20.40.20:8080/login
         method: POST
         body:
             user:${user}
             password:${password}
         label: login post

    data-sources:
       - path: ./users.csv
         delimiter: ';'
         quoted: false
         variables-name: user,password
         random-order: true

reporting:

- module: blazemeter
- module: junit-xml